stscore = [['2230001', '30101', '86'], ['2230002', '30101', '90'], ['2230003', '30101', '92'], ['2230004', '30101', '80'],
           ['2230005', '30101', '65'], ['2230006', '30101', '84'], ['2230007', '30101', '75'], ['2230008', '30101', '95'],
           ['2230009', '30101', '90'], ['2230010', '30101', '50'], ['2230001', '30102', '80'], ['2230002', '30102', '89'],
           ['2230003', '30102', '95'], ['2230004', '30102', '77'], ['2230005', '30102', '70'], ['2230006', '30102', '85'],
           ['2230007', '30102', '85'], ['2230008', '30102', '90'], ['2230009', '30102', '88'], ['2230010', '30102', '60'],
           ['2230001', '30201', '96'], ['2230002', '30201', '91'], ['2230003', '30201', '93'], ['2230006', '30201', '85'],
           ['2230007', '30201', '85'], ['2230008', '30201', '90'], ['2230009', '30201', '80'], ['2230010', '30201', '80']]

#
# instudent, insubject, inscore = input("> 수정할 데이터(학번, 과목코드, 점수) : ").split()
# removedata = []
# indata = []
#
# print("학번 : %s   과목코드 : %s    점수 : %s" %(instudent, insubject, inscore))
# removedata.append(instudent)
# removedata.append(insubject)
# removedata.append(inscore)
# stscore.remove(removedata)
# print(stscore)
#
# fstudent, fsubject, fscore = input("> 수정할 내용(학번, 과목코드, 점수) : ").split()
# indata.append(fstudent)
# indata.append(fsubject)
# indata.append(fscore)
# stscore.append(indata)
# print(stscore)
