#학과 딕셔너리
dept = {'10': '행정과', '11': '복지학과', '20': '스포츠학과', '21': '간호학과', '30': '컴소과', '31': '전자공학과', '32': '건축과'}

#교수 딕셔너리
prof = {'utlim': ['임국진', '50'], 'lee': ['이성우', '43'], 'hong': ['홍사인', '45'], 'parking': ['박찬우', '38']}

#과목 딕셔너리
subject = {'30101': ['소프트웨어원리', '3', '30', 'utlim'], '30102': ['컴퓨터구조', '3', '30', 'hong'], '30201': ['컴퓨터그래픽', '3', '30', 'lee']}

#학생 딕셔너리
student = {'2230001': ['이우주', '30'], '2230002': ['김사랑', '30'], '2230003': ['강수아', '30'], '2230004': ['박홍이', '30'],
           '2230005': ['하준', '30'], '2230006': ['서민정', '30'], '2230007': ['기수림', '30'], '2230008': ['나민영', '30'],
           '2230009': ['최사랑', '30'], '2230010': ['이보배', '30']}
#성적 리스트
stscore = [['2230001', '30101', '86'], ['2230002', '30101', '90'], ['2230003', '30101', '92'], ['2230004', '30101', '80'],
           ['2230005', '30101', '65'], ['2230006', '30101', '84'], ['2230007', '30101', '75'], ['2230008', '30101', '95'],
           ['2230009', '30101', '90'], ['2230010', '30101', '50'], ['2230001', '30102', '80'], ['2230002', '30102', '89'],
           ['2230003', '30102', '95'], ['2230004', '30102', '77'], ['2230005', '30102', '70'], ['2230006', '30102', '85'],
           ['2230007', '30102', '85'], ['2230008', '30102', '90'], ['2230009', '30102', '88'], ['2230010', '30102', '60'],
           ['2230001', '30201', '96'], ['2230002', '30201', '91'], ['2230003', '30201', '93'], ['2230006', '30201', '85'],
           ['2230007', '30201', '85'], ['2230008', '30201', '90'], ['2230009', '30201', '80'], ['2230010', '30201', '80']]

grades = {"A+": [100, 95], "A": [94, 90], "B+": [89, 85], "B": [84, 80], "C+": [79, 75], "C": [74, 70], "D+": [69, 65], "D": [64, 60], "F": [59, 0]}

gpoint = {"A+": 4.5, "A": 4.0, "B+": 3.5, "B": 3.0, "C+": 2.5, "C": 2.0, "D+": 1.5, "D": 1.0, "F": 0.0}

def get_student(stid):
    if stid in student.keys():
        val = student.get(stid)
        return val
    else:
        return ''

def get_dept(deptid):
    if deptid in dept.keys():
        val = dept.get(deptid)
        return val
    else:
        return ''

def get_prof(profid):
    if profid in prof.keys():
        val = prof.get(profid)
        return val
    else:
        return ''

def get_subject(subid):
    if subid in subject.keys():
        val = subject.get(subid)
        return val
    else:
        return ''

def rating(ascore): #등급 구하기
    asc = int(ascore)
    if asc >= 95:
        return 'A+'
    elif asc >= 90:
        return 'A'
    elif asc >= 85:
        return 'B+'
    elif asc >= 80:
        return 'B'
    elif asc >= 75:
        return 'C+'
    elif asc >= 70:
        return 'C'
    elif asc >= 65:
        return 'D+'
    elif asc >= 60:
        return 'D'
    else:
        return 'F'
